ru45/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       514000;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       514020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          515200;
        startFace       514040;
    }
    defaultFaces
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2360;
        startFace       1029240;
    }
)

// ************************************************************************* //
