ru45/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue Y00 0
    volScalarFieldValue Y10 0
);

regions
(
    boxToCell
    {
        box (-0.1 0.002 -0.1) (0.1 0.012 0.1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
            volScalarFieldValue Y00 0
            volScalarFieldValue Y10 1
        );
    }
);


// ************************************************************************* //
